feat(docs): Use mermaid for diagram
